app/controllers/authors/posts_controller.rb

UPDATE "posts" SET "published" = ?, "published_at" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["published", true], ["published_at", 2017-01-17 22:32:54 UTC], ["updated_at", 2017-01-17 22:32:54 UTC], ["id", 9]]
---
  def publish
    @post.update_attributes(published: true, published_at: Time.now)

UPDATE "posts" SET "published" = ?, "published_at" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["published", false], ["published_at", nil], ["updated_at", 2017-01-17 22:32:56 UTC], ["id", 9]]
---
  def unpublish
    @post.update(published: false, published_at: nil)

INSERT INTO "posts" ("title", "body", "description", "slug", "created_at", "updated_at", "banner_image_url") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "1"], ["body", "2"], ["description", "2"], ["slug", "1"], ["created_at", 2017-01-11 10:45:20 UTC], ["updated_at", 2017-01-11 10:45:20 UTC], ["banner_image_url", ""]]
---
  def create
    @post = current_author.posts.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "slug" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "aa12"], ["slug", "aa12"], ["updated_at", 2017-01-11 10:56:23 UTC], ["id", 7]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 6]]
---
  def destroy
    @post.delete

SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ? ORDER BY "posts"."id" DESC  [["author_id", 1]]
---
    def set_post
      @post = current_author.posts.friendly.find(params[:id])