app/controllers/blog/posts_controller.rb

  def index
    @posts = Post.most_recent.published
    @posts = Post.paginate(:page => params[:page], per_page: 3)
---
SELECT "posts".* FROM "posts" WHERE "posts"."published" = ? ORDER BY "posts"."id" DESC  [["published", true]]
SELECT COUNT(*) FROM "posts"